#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bryanhonof/pxl-webtech/runs/run-niE8mRgX76ZNS37P

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.student_servers["Thibe"].gandi_livedns_record.a_record will be created
  + resource "gandi_livedns_record" "a_record" {
      + href   = (known after apply)
      + id     = (known after apply)
      + name   = "server-of-thibe.pxl"
      + ttl    = 10800
      + type   = "A"
      + values = (known after apply)
      + zone   = "bjth.xyz"
    }

  # module.student_servers["Thibe"].gandi_livedns_record.aaaa_record will be created
  + resource "gandi_livedns_record" "aaaa_record" {
      + href   = (known after apply)
      + id     = (known after apply)
      + name   = "server-of-thibe.pxl"
      + ttl    = 10800
      + type   = "AAAA"
      + values = (known after apply)
      + zone   = "bjth.xyz"
    }

  # module.student_servers["Thibe"].hcloud_server.server will be created
  + resource "hcloud_server" "server" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "fedora-38"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + location                   = "fsn1"
      + name                       = "server-of-thibe"
      + rebuild_protection         = false
      + server_type                = "cx11"
      + ssh_keys                   = (known after apply)
      + status                     = (known after apply)
      + user_data                  = "9aOMqvCZHEdO5nK50+dCpvwENr4="

      + public_net {
          + ipv4         = (known after apply)
          + ipv4_enabled = true
          + ipv6         = (known after apply)
          + ipv6_enabled = true
        }
    }

  # module.student_servers["Thibe"].hcloud_ssh_key.ssh_keys[0] will be created
  + resource "hcloud_ssh_key" "ssh_keys" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "SSH Key 0 of thibe"
      + public_key  = "SHA256:fv6PYIMthlswa0GPJebDQFyP+dZvLUwAMxEOQDnRpqg gebruiker@DESKTOP-BEAVFHB"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 4 estimated
           $0.0/mo +$0.0

```

</details>

*Pusher: @bryanhonof, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Validate and Plan Workflow`*